import streamlit as st

st.header('経歴')
st.subheader('高校時代')
st.text('地元の工業高校に入学し、プログラミングに出会う\n'
        '学校では、C言語を学び、科学部に所属する\n'
        '学校には、興味なかったが、部活に力を注いでいた。部活の内容はトンボ玉の作成と実験\n'
        'トンボ玉は作成し、アクセサリー(イヤホンジャックやネックレス等)にして、文化祭で販売していた\n'
        '実験は、石鹸の作成(簡単にいうと、油と水酸化ナトリウムを混ぜるだけ)とガリレオ温度計の作成をしていた\n'
        '実験の内容は、ポスターをつくり、某大学で、ポスター発表をしていた\n'
        '高校3年では、課題研究で、掃除ロボット(モップ掛けするロボット)を作成\n'
        'PICボードをC言語で制御していた')
st.write('当時のスマホ　イヤホンジャックを自分でつくったよ！！')
st.image('./image/image01.jpg',width=150)
